apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mu.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_mu.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MU_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MU_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* MU Register Offsets ******************************************************/

#define S32K3XX_MU_VER_OFFSET   (0x0000) /* Version ID Register (VER) */
#define S32K3XX_MU_PAR_OFFSET   (0x0004) /* Parameter Register (PAR) */
#define S32K3XX_MU_CR_OFFSET    (0x0008) /* Control Register (CR) */
#define S32K3XX_MU_SR_OFFSET    (0x000c) /* Status Register (SR) */
#define S32K3XX_MU_CCR0_OFFSET  (0x0010) /* Core Control Register 0 (CCR0) */
#define S32K3XX_MU_CSSR0_OFFSET (0x0018) /* Core Sticky Status Register 0 (CSSR0) */
#define S32K3XX_MU_FCR_OFFSET   (0x0100) /* Flag Control Register (FCR) */
#define S32K3XX_MU_FSR_OFFSET   (0x0104) /* Flag Status Register (FSR) */
#define S32K3XX_MU_GIER_OFFSET  (0x0110) /* General Interrupt Enable Register (GIER) */
#define S32K3XX_MU_GCR_OFFSET   (0x0114) /* General Control Register (GCR) */
#define S32K3XX_MU_GSR_OFFSET   (0x0118) /* General Status Register (GSR) */
#define S32K3XX_MU_TCR_OFFSET   (0x0120) /* Transmit Control Register (TCR) */
#define S32K3XX_MU_TSR_OFFSET   (0x0124) /* Transmit Status Register (TSR) */
#define S32K3XX_MU_RCR_OFFSET   (0x0128) /* Receive Control Register (RCR) */
#define S32K3XX_MU_RSR_OFFSET   (0x012c) /* Receive Status Register (RSR) */
#define S32K3XX_MU_TR0_OFFSET   (0x0200) /* Transmit Register 0 (TR0) */
#define S32K3XX_MU_TR1_OFFSET   (0x0204) /* Transmit Register 1 (TR1) */
#define S32K3XX_MU_TR2_OFFSET   (0x0208) /* Transmit Register 2 (TR2) */
#define S32K3XX_MU_TR3_OFFSET   (0x020c) /* Transmit Register 3 (TR3) */
#define S32K3XX_MU_RR0_OFFSET   (0x0280) /* Receive Register 0 (RR0) */
#define S32K3XX_MU_RR1_OFFSET   (0x0284) /* Receive Register 1 (RR1) */
#define S32K3XX_MU_RR2_OFFSET   (0x0288) /* Receive Register 2 (RR2) */
#define S32K3XX_MU_RR3_OFFSET   (0x028c) /* Receive Register 3 (RR3) */

/* MU Register Addresses ****************************************************/

#define S32K3XX_MU0_MUB_VER     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_VER_OFFSET)
#define S32K3XX_MU0_MUB_PAR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_PAR_OFFSET)
#define S32K3XX_MU0_MUB_CR      (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_CR_OFFSET)
#define S32K3XX_MU0_MUB_SR      (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_SR_OFFSET)
#define S32K3XX_MU0_MUB_CCR0    (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_CCR0_OFFSET)
#define S32K3XX_MU0_MUB_CSSR0   (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_CSSR0_OFFSET)
#define S32K3XX_MU0_MUB_FCR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_FCR_OFFSET)
#define S32K3XX_MU0_MUB_FSR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_FSR_OFFSET)
#define S32K3XX_MU0_MUB_GIER    (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_GIER_OFFSET)
#define S32K3XX_MU0_MUB_GCR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_GCR_OFFSET)
#define S32K3XX_MU0_MUB_GSR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_GSR_OFFSET)
#define S32K3XX_MU0_MUB_TCR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TCR_OFFSET)
#define S32K3XX_MU0_MUB_TSR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TSR_OFFSET)
#define S32K3XX_MU0_MUB_RCR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RCR_OFFSET)
#define S32K3XX_MU0_MUB_RSR     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RSR_OFFSET)
#define S32K3XX_MU0_MUB_TR0     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TR0_OFFSET)
#define S32K3XX_MU0_MUB_TR1     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TR1_OFFSET)
#define S32K3XX_MU0_MUB_TR2     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TR2_OFFSET)
#define S32K3XX_MU0_MUB_TR3     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_TR3_OFFSET)
#define S32K3XX_MU0_MUB_RR0     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RR0_OFFSET)
#define S32K3XX_MU0_MUB_RR1     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RR1_OFFSET)
#define S32K3XX_MU0_MUB_RR2     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RR2_OFFSET)
#define S32K3XX_MU0_MUB_RR3     (S32K3XX_MU0_MUB_BASE + S32K3XX_MU_RR3_OFFSET)

#define S32K3XX_MU1_MUB_VER     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_VER_OFFSET)
#define S32K3XX_MU1_MUB_PAR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_PAR_OFFSET)
#define S32K3XX_MU1_MUB_CR      (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_CR_OFFSET)
#define S32K3XX_MU1_MUB_SR      (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_SR_OFFSET)
#define S32K3XX_MU1_MUB_CCR0    (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_CCR0_OFFSET)
#define S32K3XX_MU1_MUB_CSSR0   (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_CSSR0_OFFSET)
#define S32K3XX_MU1_MUB_FCR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_FCR_OFFSET)
#define S32K3XX_MU1_MUB_FSR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_FSR_OFFSET)
#define S32K3XX_MU1_MUB_GIER    (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_GIER_OFFSET)
#define S32K3XX_MU1_MUB_GCR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_GCR_OFFSET)
#define S32K3XX_MU1_MUB_GSR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_GSR_OFFSET)
#define S32K3XX_MU1_MUB_TCR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TCR_OFFSET)
#define S32K3XX_MU1_MUB_TSR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TSR_OFFSET)
#define S32K3XX_MU1_MUB_RCR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RCR_OFFSET)
#define S32K3XX_MU1_MUB_RSR     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RSR_OFFSET)
#define S32K3XX_MU1_MUB_TR0     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TR0_OFFSET)
#define S32K3XX_MU1_MUB_TR1     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TR1_OFFSET)
#define S32K3XX_MU1_MUB_TR2     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TR2_OFFSET)
#define S32K3XX_MU1_MUB_TR3     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_TR3_OFFSET)
#define S32K3XX_MU1_MUB_RR0     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RR0_OFFSET)
#define S32K3XX_MU1_MUB_RR1     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RR1_OFFSET)
#define S32K3XX_MU1_MUB_RR2     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RR2_OFFSET)
#define S32K3XX_MU1_MUB_RR3     (S32K3XX_MU1_MUB_BASE + S32K3XX_MU_RR3_OFFSET)

#define S32K3XX_MU2_MUA_VER     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_VER_OFFSET)
#define S32K3XX_MU2_MUA_PAR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_PAR_OFFSET)
#define S32K3XX_MU2_MUA_CR      (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_CR_OFFSET)
#define S32K3XX_MU2_MUA_SR      (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_SR_OFFSET)
#define S32K3XX_MU2_MUA_FCR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_FCR_OFFSET)
#define S32K3XX_MU2_MUA_FSR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_FSR_OFFSET)
#define S32K3XX_MU2_MUA_GIER    (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_GIER_OFFSET)
#define S32K3XX_MU2_MUA_GCR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_GCR_OFFSET)
#define S32K3XX_MU2_MUA_GSR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_GSR_OFFSET)
#define S32K3XX_MU2_MUA_TCR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TCR_OFFSET)
#define S32K3XX_MU2_MUA_TSR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TSR_OFFSET)
#define S32K3XX_MU2_MUA_RCR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RCR_OFFSET)
#define S32K3XX_MU2_MUA_RSR     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RSR_OFFSET)
#define S32K3XX_MU2_MUA_TR0     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TR0_OFFSET)
#define S32K3XX_MU2_MUA_TR1     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TR1_OFFSET)
#define S32K3XX_MU2_MUA_TR2     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TR2_OFFSET)
#define S32K3XX_MU2_MUA_TR3     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_TR3_OFFSET)
#define S32K3XX_MU2_MUA_RR0     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RR0_OFFSET)
#define S32K3XX_MU2_MUA_RR1     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RR1_OFFSET)
#define S32K3XX_MU2_MUA_RR2     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RR2_OFFSET)
#define S32K3XX_MU2_MUA_RR3     (S32K3XX_MU2_MUA_BASE + S32K3XX_MU_RR3_OFFSET)

