apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mu.h
/* Transmit Control Register (TCR) */

#define MU_TCR_TIE_SHIFT        (0)        /* Bits 0-3: MU Transmit Interrupt Enable n (TIEn) */
#define MU_TCR_TIE_MASK         (0x0f << MU_TCR_TIE_SHIFT)
#  define MU_TCR_TIE0           (1 << 0)   /* Bit 0: MU Transmit Interrupt Enable 0 (TIE0) */
#  define MU_TCR_TIE1           (1 << 1)   /* Bit 1: MU Transmit Interrupt Enable 1 (TIE1) */
#  define MU_TCR_TIE2           (1 << 2)   /* Bit 2: MU Transmit Interrupt Enable 2 (TIE2) */
#  define MU_TCR_TIE3           (1 << 3)   /* Bit 3: MU Transmit Interrupt Enable 3 (TIE3) */
                                           /* Bits 4-31: Reserved */

/* Transmit Status Register (TSR) */

#define MU_TSR_TE_SHIFT         (0)        /* Bits 0-3: MU Transmit Register n Empty (TEn) */
#define MU_TSR_TE_MASK          (0x0f << MU_TSR_TE_SHIFT)
#  define MU_TSR_TE0            (1 << 0)   /* Bit 0: MU Transmit Register 0 Empty (TE0) */
#  define MU_TSR_TE1            (1 << 1)   /* Bit 1: MU Transmit Register 1 Empty (TE1) */
#  define MU_TSR_TE2            (1 << 2)   /* Bit 2: MU Transmit Register 2 Empty (TE2) */
#  define MU_TSR_TE3            (1 << 3)   /* Bit 3: MU Transmit Register 3 Empty (TE3) */
                                           /* Bits 4-31: Reserved */

/* Receive Control Register (RCR) */

#define MU_RCR_RIE_SHIFT        (0)        /* Bits 0-3: MU Receive Interrupt Enable n (RIEn) */
#define MU_RCR_RIE_MASK         (0x0f << MU_RCR_RIE_SHIFT)
#  define MU_RCR_RIE0           (1 << 0)   /* Bit 0: MUA Receive Interrupt Enable 0 (RIE0) */
#  define MU_RCR_RIE1           (1 << 1)   /* Bit 1: MUA Receive Interrupt Enable 1 (RIE1) */
#  define MU_RCR_RIE2           (1 << 2)   /* Bit 2: MUA Receive Interrupt Enable 2 (RIE2) */
#  define MU_RCR_RIE3           (1 << 3)   /* Bit 3: MUA Receive Interrupt Enable 3 (RIE3) */
                                           /* Bits 4-31: Reserved */

/* Receive Status Register (RSR) */

#define MU_RSR_RF_SHIFT         (0)        /* Bits 0-3: MU Receive Register n Full (RFn) */
#define MU_RSR_RF_MASK          (0x0f << MU_RSR_RF_SHIFT)
#  define MU_RSR_RF0            (1 << 0)   /* Bit 0: MUA Receive Register 0 Full (RF0) */
#  define MU_RSR_RF1            (1 << 1)   /* Bit 1: MUA Receive Register 1 Full (RF1) */
#  define MU_RSR_RF2            (1 << 2)   /* Bit 2: MUA Receive Register 2 Full (RF2) */
#  define MU_RSR_RF3            (1 << 3)   /* Bit 3: MUA Receive Register 3 Full (RF3) */
                                           /* Bits 4-31: Reserved */

/* Transmit Register (TRn) */

#define MU_TR_DATA_SHIFT        (0)        /* Bits 0-31: MU Transmit Data (TR_DATA) */
#define MU_TR_DATA_MASK         (0xffffffff << MU_TR_DATA_SHIFT)

/* Receive Register (RRn) */

#define MU_RR_DATA_SHIFT        (0)        /* Bits 0-31: MU Receive Data (RR_DATA) */
#define MU_RR_DATA_MASK         (0xffffffff << MU_RR_DATA_SHIFT)

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MU_H */
